# Introductions to SQL

In [ ]:
# database is collection of data organzed in tables. table rows are called records, table columns are called fields. 
# fields (columns) are set at database creation, there is no limit to the number of records.

# table column naming best practices such as be in lowercase, have no spaces or use underscores when needed, refer to a collective group, be different.
# from other field names, be different from the table name.
# records is a row that holds data on an individual observation on contrast a field is a column that holds one piece of imformation about all records.
# unique identifiers are used to indentify records in a table name which is callled primary key of the table.
# different data types are stored in different columns and take different space.
# some operations are work only certain data types. some data types are VARCHAR, INT, NUMERIC.
# database schema is way the database is organized such as number of tables, table columns and their data types and relationships, constraints and more.

In [ ]:
# sql is a programming  language which is used to create databases and query data from databases.

In [ ]:
SELECT *
FROM tables_name; # return all the records from specified table.

In [ ]:
SELECT column_name, column_name, column_name
FROM table_name; # getting the ressult set from specied columns and specified table name

In [ ]:
SELECT column_name AS Name # aliased name is only for result set it do not change database actual column_name
FROM table_name;

In [ ]:
SELECT DISTINCT column_name
FROM table_name; # getting all the unique data from the specified column

In [ ]:
SELECT column_name
FROM table_name
LIMIT 5; # limitting the result set to 5

In [ ]:
# a view is a virtual table that is the result of a saved SQL query. views are automatically update in response to updates in the underlying data.
CREATE VIEW view_name AS
SELECT column_name, column_name, column_name
FROM table_name;

In [ ]:
# sql has many falovors on it. some of them are free and paid. but differences are small.

# Intermediate SQL

In [ ]:
# counting the number of records within a field used as alias for clarity
SELECT COUNT(column_name_1) AS count_column_name_1, COUNT(column_name_2) AS count_column_name_2
FROM table_name;

In [ ]:
# COUNT(column_name) counts values in a field
# COUNT(*) counts records in a table
SELECT COUNT(*) AS total_records_in_table
FROM table_name;

In [ ]:
SELECT COUNT(DISTINCT column_name) AS count_distinct_column_name # COUNT() include duplicates
FROM table_name; # counting distinct values in column              DISTINCT excludes duplicates

In [ ]:
# SQL isn't processed in its written order 
SELECT column_name # order of execution 2 
FROM table_name # order of execution 1
LIMIT 10; # order of execution 3

# common errors are misspelling, incorrect capitalization, incorrect or missing punctuation, comma errors, keyword error

In [ ]:
# formatting is not required but lack of formatting can cause issues 
# capitalize keywords, add new lines to when writing new keyword 
# column name instead of column_name if there is non standard column name "column name"

In [ ]:
# benefits of formatting are easier collabortion, clean and readable, looks professional, easier to understand, easier to debug

In [ ]:
# filtering works in row level using WHERE cluase 
# filtering based on string data type 
SELECT column_name, column_name
FROM table_name
where column_name = 'string_value'; # use single quote when filter

In [ ]:
# filtering based on numaric data type
SELECT column_name, column_name
FROM table_name
WHERE column_name > 1950; # used comparison operator = <> < <= >=

In [ ]:
SELECT column_name # order of execution 3
FROM table_name # order of execution 1
WHERE condition # order of execution 2
LIMIT 5; # order of execution 4

# alias used in SELECT clause can not be used in WHERE clause because WHERE Clause execute before the SELECT clause

In [ ]:
SELECT column_name
FROM table_name
WHERE condition OR condition;  # OR key word for combining multiple condition, atleast one condition must be true

In [ ]:
SELECT column_name
FROM table_name
WHERE condition AND condition;  # AND key word for combining multiple condition, all the condition must be true

In [ ]:
SELECT column_name
FROM table_name
WHERE (condition OR condition) AND (condition OR condition);

In [ ]:
SELECT column_name
FROM table_name
WHERE released_year >= 2000 AND released_year <= 2010;

In [ ]:
# above code is same as below 
SELECT column_name
FROM table_name
WHERE released_year BETWEEN 2000 AND 2010;

In [ ]:
# filtering  text data using pattern 
# % zero, one, or many characters 
SELECT column_name
FROM table_name 
WHERE column_name LIKE 'SAM%';

In [ ]:
# filtering  text data using pattern 
# % zero, one, or many characters 
SELECT column_name
FROM table_name 
WHERE column_name LIKE 'SAM%';

In [ ]:
# opposite of the above SQL statement 
SELECT column_name
FROM table_name 
WHERE column_name NOT LIKE 'SAM%';

In [ ]:
# filtering  text data using pattern 
# _ match a single character 
SELECT column_name
FROM table_name 
WHERE column_name LIKE 'SA_';

In [ ]:
# IN operator for filtering on multiple values
SELECT column_name
FROM table_name
WHERE release_year IN (2020, 2021, 2022);

In [ ]:
# IN operator for filtering on multiple values
SELECT column_name
FROM table_name
WHERE country IN ('India', 'Sri Lanka', 'Nepal');

In [ ]:
# COUNT(*) include missing values
# COUNT(column_name) # include only non missing values

In [ ]:
# filtering based on null values
SELECT column_name
FROM table_name
WHERE column_name IS NULL; # return only null values

In [ ]:
# filtering based on null values
SELECT column_name
FROM table_name
WHERE column_name IS NOT NULL; # return only null values

In [ ]:
# SQL aggregation function return a single value 
# numarical Fields only AVG(), SUM()
# various data types COUNT(), MIN(), MAX()

In [ ]:
SELECT # AVG(column_name) SUM(column_name) COUNT(column_name) MIN(column_name) MAX(column_name)
FROM table_name
WHERE condition;

In [ ]:
# ROUND() numaric columns only 
SELECT ROUND(AVG(column_name),1) AS round_avg_column # ROUND(numerical value to round, number of decimal places) it also accept negative decimal number
FROM table_name 
WHERE condition;

In [ ]:
SELECT (3+5)
SELECT (5.0-3.0) # use float number to return with decimal places otherwise only return integer value 
SELECT (3*5)
SELECT (6/2)

In [ ]:
# aggregation function work on column lavel, arithmatic works on row level
SELECT (column_name + column_name) AS derived_column
FROM table_name;

In [ ]:
# order the result set by specified column 
SELECT column_name
FROM table_name
ORDER BY column_name; # ASC for ascending, DESC for descending, defult is acsending order

In [ ]:
SELECT column_name
FROM table_name
ORDER BY column_name ASC, column_name DESC;

In [ ]:
SELECT column_name # order of execution 3
FROM table_name    # order of execution 1
WHERE condition    # order of execution 2
ORDER BY column_name # order of execution 4
LIMIT 5; # order of execution 5

In [ ]:
# grouping data based on columns 
SELECT column_name
FROM table_name 
GROUP BY column_name; # the only column we do not put in GROUP BY coluse is aggragation column

In [ ]:
SELECT column_name # order of execution 3
FROM table_name # order of execution 1
GROUP BY column_name # order of execution 2
ORDER BY column_name # order of execution 4
LIMIT 5; # order of execution 5

In [ ]:
# WHERE filter individual records, HAVING filters grouped records

In [ ]:
SELECT column_name # order of execution 5
FROM table_name # order of execution 1 
WHERE condition # order of execution 2
GROUP BY column_name # order of execution 3 
HAVING condition # order of execution 4
ORDER BY column_name # order of execution 6
LIMIT 5; # order of execution 7

# joining data in SQL

In [ ]:
# when it comes to inner join, it look for unique records in both table
# table_name.column_name used to avoid error that is resulted when joining tables columns names are same.
SELECT table_name.column_name, table_name.column_name, table_name.column_name
FROM table_name 
INNER JOIN table_name
ON table_name_id = table_name_id;

In [ ]:
# aliasing tables
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2 
ON t1.id = t2.id;

In [ ]:
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2 
USING(id); # we use the using to when joining tables are have the same column_name

In [ ]:
SELECT t1.column_name, t2.column_name, t3.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2
HAVING(id)
INNER JOIN table_name AS t3 
HAVING(id);

In [ ]:
SELECT t1.column_name, t2.column_name, t3.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2
ON t1.id = t2.id
INNER JOIN table_name AS t3 
ON t2.id = t3.id;

In [ ]:
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2
ON t1.id = t2.id AND t1.column_name = t2.column_name; # joining tables with multiple columns

In [ ]:
# LEFT JOIN return all the records in the left table and those records in the right tables that match on the joiing column provided
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
LEFT JOIN table_name AS t2 # can be written LEFT OUTER JOIN
HAVING (id);

In [ ]:
# RIGHT JOIN return all the records in the right table and those records in the left tables that match on the joiing column provided
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
RIGHT JOIN table_name AS t2 # can be written RIGHT OUTER JOIN
HAVING (id); # we can use left join as a right join by just flipping the table order

In [ ]:
# FULL JOIN combine LEFT and RIGHT JOIN
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
FULL JOIN table_name AS t2 # can be written FULL OUTER JOIN 
HAVING (id);

In [ ]:
# CROSS JOIN create all possible combination of two tables
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
CROSS JOIN table_name AS t2;

In [ ]:
# SELF JOIN are tables join themselves, it can be used to compare parts of the table
SELECT t1.column_name, t2.column_name
FROM table_name AS t1
INNER JOIN table_name AS t2 # we joining the same table 
ON t1.id = t2.id AND t1.column_name <> t2.column_name;

In [ ]:
# UNION takes two tables an input, and return all records from both tables, UNION ALL includes duplicates
SELECT *
FROM table_name 
UNION 
SELECT * 
FROM table_name;

SELECT *
FROM table_name 
UNION ALL
SELECT * 
FROM table_name;

In [ ]:
# INTERSECT only return values in both table, no duplicates, it is like INNER JOIN which never exclude duplicates
SELECT *
FROM table_name
INTERSECT
SELECT *
FROM table_name;

In [ ]:
# EXCEPT allows us to identify the records that are present in one table, but not the other. 
SELECT *
FROM table_name
EXCEPT
SELECT *
FROM table_name;

In [ ]:
# semi join chooses records in the first table where a condition is met in the second table 
# semi join (subqueries)
# subquery in WHERE cluase 
SELECT column_name, column_name, column_name
FROM table_name
WHERE column_name IN (
    SELECT column_name
    FROM table_name
    WHERE condition
);

# anti join 
SELECT column_name, column_name, column_name
FROM table_name
WHERE column_name NOT IN (
    SELECT column_name
    FROM table_name
    WHERE condition
);

# subquery table can be same table or another table

In [ ]:
# subquery in SELECT clause 
SELECT DISTINCT column_name, (
    SELECT COUNT(*)
    FROM table_name
    WHERE table_name.column_name = table_name.column_name
) AS name
FROM table-name;

In [ ]:
#Subqueries inside FROM can help select columns from multiple tables in a single query.
# subquery from from clause 
SELECT DISTINCT table_name.column_name, sub.aliased_name # we use distinct  because it return duplicates
FROM table_name, (
    SELECT column_name, AGG_FUNCTION(column_name) AS aliased_name
    FROM table_name
    GROUP BY column_name
) AS sub
WHERE table_name.column_name = sub.column_name
ORDER BY column_name;

# Data Manupulaion in SQL

In [ ]:
# case statement for categorizing data
SELECT *
FROM table_name
CASE WHEN condition THEN category
     WHEN condition THEN category
     ELSE category END AS column_name

In [ ]:
# case statement for categorizing data
SELECT *
FROM table_name
CASE WHEN condition AND condition THEN category
     WHEN condition AND condition THEN category
     ELSE category END AS column_name # specify correctly else statement
WHERE condition

In [ ]:
# to avoid  null values in where cluase 
SELECT *
FROM table_name
CASE WHEN condition AND condition THEN category
     WHEN condition AND condition THEN category
     ELSE  category END AS column_name # specify correctly else statement
WHERE WHEN condition AND condition THEN category
      WHEN condition AND condition THEN category
      ELSE category END IS NOT NULL; # only return non null values

In [ ]:
# to aggregate data by case statemnt 
SELECT column_name, COUNT(CASE WHEN condition THEN category END) AS name, COUNT(CASE WHEN condition THEN category END) AS name
FROM table_name
GROUP BY column_name;

# when working with numerical functions like sum() summing over given column
SELECT column_name, SUM(CASE WHEN condition THEN column_name END) AS sum_name, COUNT(CASE WHEN condition THEN column_name END) AS sum_name
FROM table_name
GROUP BY column_name;

# avg() with round()
SELECT column_name, ROUND(AVG(CASE WHEN condition THEN column_name END),2) AS sum_name,
       ROUND(AVG(CASE WHEN condition THEN column_name END),2) AS sum_name
FROM table_name
GROUP BY column_name;

In [ ]:
# subquery  benefits are comparing groups to summarized values, and reshaping data, connect data that can not be joinned

# subqueries in where clause, comparing groups to summarized values
SELECT *
FROM table_name
WHERE column_name  > (
    SELECT AVG(column_name)
    FROM table_name
)

# subqueries in ehere clause, filtering list of values with IN keyword

SELECT *
FROM table_name
WHERE column_name IN (
    SELECT column_name
    FROM table_name
    WHERE condition 
)

In [ ]:
# sub queries in FROM clause used for resructure and transform your data 
# tansforming data from long to wide before selecting
# prefiltering data
# calculating aggreagtes of aggreagtes
# we can create multiple subqueries in one statement must be alias them and join them 
# can join a subquery to a table in FROM, include a joining columns in both tables!

SELECT *
FROM (SELECT column_name
      FROM table_name
      LEFT JOIN table_name
      HAVING(id)
      WHERE condition 
      GROUPE BY column_name) AS subquery 
ORDER BY column_name
LIMIT5;

In [ ]:
# sub queries in a SELECT statement to being summary values into a detailed data set
# returns a single value - include aggregate values to compare to individual values 
# used in mathematical calculations 

SELECT column_name, COUNT(column_name) AS aliased_name, (SELECT COUNT(column_name) FROM table_name) AS aliased_name
FROM column_name
GROUP BY column_name

# need to return a single value otherwise error 
# make sure you have all filters in the right places

In [ ]:
# format your queries, line up
# use commants as a annotate multiple line commant or in line commant 
# indent correctly 
# think about is that subquery necessary?